DataProcessors/ОтправитьПродажиНаПочту_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ОтправитьПродажиНаПочту_СД</Name>
			<Comment>//С.Д. Сеня 10,08,23 +</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоговоров_СД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ШаблоныЗагрузкиОстатковПоставщиков_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныЗагрузкиОстатковПоставщиков_СД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервойСтроки</Name>
					<Comment>Номер первой строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтраницыЗагрузки</Name>
					<Comment>Номер страницы загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиНоменклатура</Name>
					<Comment>Номер колонки номенклатура</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиКоличество</Name>
					<Comment>Номер колонки количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаСоСкидкой</Name>
					<Comment>Номер колонки цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаОпт</Name>
					<Comment>Номер колонки цена со скидкой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаРекомендована</Name>
					<Comment>Номер колонки цена рекомендована</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоговоров_СД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Comment>Документ, к которому относится данное движение</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ОтправитьПродажиНаПочту_СД/Ext/ObjectModule.bsl
Процедура ЗаполнитьПоШаблону() Экспорт 
	
	ПоПочте = Истина;
	
	Если НЕ ЗначениеЗаполнено(ГруппаДоговоров) или не ЗначениеЗаполнено(Поставщик)Тогда
		#Если Клиент Тогда
			Предупреждение("Укажите Поставщика и Группу договоров!");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) и ЗначениеЗаполнено(ГруппаДоговоров) Тогда 
		отбСр = новый Структура("Поставщик", Поставщик);
		отбСр.Вставить("ГруппаДоговоров", ГруппаДоговоров);
		ШаблонСрез = РегистрыСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(ДатаПродажи, отбСр);
		Если не ШаблонСрез.Количество() = 0 Тогда 
			
			ЭтотОбъект.УчетнаяЗаписьЭлектроннойПочты = ШаблонСрез[0].УчетнаяЗаписьЭлектроннойПочты;
			ЭтотОбъект.ПочтаПоставщика 				 = ШаблонСрез[0].ПочтаПоставщика;
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	

Процедура ЗаполнитьПродажи() Экспорт 
	
	Если не ЗначениеЗаполнено(ДатаПродажи) Тогда 
		#Если Клиент Тогда
			Предупреждение("Укажите Дату продажи!");
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	
	ЗапрсоПрод = Новый запрос;
	ЗапрсоПрод.Текст = "ВЫБРАТЬ
	                   |	МАКСИМУМ(НоменклатураПоставщика.Ссылка) КАК Ссылка,
	                   |	НоменклатураПоставщика.Номенклатура
	                   |ПОМЕСТИТЬ НоменклатураПоставщика_врем
	                   |ИЗ
	                   |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
	                   |ГДЕ
	                   |	НоменклатураПоставщика.Владелец = &Контрагент
	                   |	И НЕ НоменклатураПоставщика.ПометкаУдаления
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	НоменклатураПоставщика.Номенклатура
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                   |	ВложенныйЗапрос.Номенклатура,
	                   |	ВложенныйЗапрос.Количество,
	                   |	ВложенныйЗапрос.Стоимость,
	                   |	ВЫРАЗИТЬ(ВЫБОР
	                   |			КОГДА ВложенныйЗапрос.Количество = 0
	                   |				ТОГДА 0
	                   |			ИНАЧЕ ВложенныйЗапрос.Стоимость / ВложенныйЗапрос.Количество
	                   |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
	                   |	ЕСТЬNULL(НоменклатураПоставщика_врем.Ссылка, ЗНАЧЕНИЕ(справочник.номенклатурапоставщика.ПустаяСсылка)) КАК НоменклатураПоставщика
	                   |ИЗ
	                   |	(ВЫБРАТЬ
	                   |		ПродажиСебестоимостьОбороты.Номенклатура КАК Номенклатура,
	                   |		СУММА(ПродажиСебестоимостьОбороты.КоличествоОборот) КАК Количество,
	                   |		СУММА(ПродажиСебестоимостьОбороты.СтоимостьОборот) КАК Стоимость
	                   |	ИЗ
	                   |		РегистрНакопления.ПродажиСебестоимость.Обороты(
	                   |				НАЧАЛОПЕРИОДА(&ДатаПродаж, ДЕНЬ),
	                   |				КОНЕЦПЕРИОДА(&ДатаПродаж, ДЕНЬ),
	                   |				,
	                   |				ДокументОприходования.ДоговорКонтрагента В (&ДоговорКонтрагента)
	                   |					И ДокументОприходования.Контрагент = &Контрагент) КАК ПродажиСебестоимостьОбороты
	                   |	
	                   |	СГРУППИРОВАТЬ ПО
	                   |		ПродажиСебестоимостьОбороты.Номенклатура) КАК ВложенныйЗапрос
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПоставщика_врем КАК НоменклатураПоставщика_врем
	                   |		ПО ВложенныйЗапрос.Номенклатура = НоменклатураПоставщика_врем.Номенклатура";
	
 	ЗапрсоПрод.УстановитьПараметр("ДатаПродаж", ДатаПродажи);
 	ЗапрсоПрод.УстановитьПараметр("Контрагент", Поставщик);
 	ЗапрсоПрод.УстановитьПараметр("ДоговорКонтрагента", ГруппаДоговоров.Договора.ВыгрузитьКолонку("Договор"));
	
	РезПрод = ЗапрсоПрод.Выполнить().Выгрузить();
	
	Продажи.Очистить();
	
	для Каждого СтрПрод из РезПрод Цикл 
		
		НовСтр = Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрПрод);
		
	КонецЦикла;	
КонецПроцедуры	

Процедура ОтправитьПоставщику() Экспорт 
	
	Если Продажи.Количество() = 0 Тогда 
		#Если Клиент Тогда   			
			Предупреждение("Продажи не заполнены!");
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) и ЗначениеЗаполнено(СокрЛП(ПочтаПоставщика)) Тогда  	 
		Каталог = КаталогВременныхФайлов();
		ИмяФайла = Каталог+""+СокрЛП(Поставщик.Наименование) + "" +"_Продаж_" + Формат(ДатаПродажи, "ДФ=dd.MM.yyyy")+".xls";
		ВыгрузитьВXLS(ИмяФайла);
		ИнтернетПочта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.ИмяОтправителя = Профиль.Пользователь;
		Сообщение.Отправитель = Профиль.Пользователь;
		Сообщение.Тема = "Продаж за " + Формат(ДатаПродажи,"ДФ='dd.MM.yyyy'" );
		Сообщение.Получатели.Добавить(СокрЛП(ПочтаПоставщика));  
		
		текстПисьма = "";
		//НомерПП = 1;
		//для Каждого СтрНоНом из СписокНовыхНоменклатураПоставщика Цикл 
		//	текстПисьма = текстПисьма + НомерПП + ". " + Символы.Таб + СтрНоНом.НоменклатураПоставщика.Наименование + Символы.ПС;
		//	НомерПП = НомерПП + 1;
		//КонецЦикла;	
		ВалУпр = Константы.ВалютаУправленческогоУчета.Получить();
		текстПисьма = "Всього продано на суму = " + Строка(Продажи.Итог("Стоимость")) + " " + НРег(ВалУпр.Наименование) + ". У кількості = " + Строка(Продажи.Итог("Количество"))+" . ";
		Сообщение.Тексты.Добавить(текстПисьма);
		
		Сообщение.Вложения.Добавить(ИмяФайла, );
		
		Попытка
			//Состояние("Отправка почтового сообщения...");
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Сообщение);
			#Если Клиент Тогда   			
				Предупреждение("Сообщение успешно отправлено!");
			#КонецЕсли
		Исключение
			#Если Клиент Тогда   			
				Сообщить("Ошибка ...",СтатусСообщения.ОченьВажное);
				Сообщить(""+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
		ИнтернетПочта.Отключиться(); 
		Попытка
			УдалитьФайлы(ИмяФайла);  				
		Исключение	
		КонецПопытки;
	КонецЕсли;
	
	СоздатьЗаказПоставщику();//С.Д. Сеня 15,08,23 +
КонецПроцедуры	
                                     
Процедура СоздатьЗаказПоставщику() Экспорт   
	
	//с.д. рижий 2023-09-11 (
	Если не ЗначениеЗаполнено(ДатаЗаказПоставщика) тогда
		ДатаЗаказПоставщика = ТекущаяДата()
	КонецЕсли;	
	//с.д. Рижий 2023-09 11 )
	//Завданя:
	//[4]. в обробці по відправці даних про продажі (із задачі[3]) додати механізм створення Документа [замовленя постачальнику]
	//по кожному контрагенту та договору  якому відправили  і заповнюється номенклатурою , к-сть, собівартістю, , та коментар з словом авто. створений дозаказ. 
	Если ЗначениеЗаполнено(Поставщик) и ЗначениеЗаполнено(ГруппаДоговоров) и Продажи.Количество() <> 0 Тогда 
		
		УжеСоздан = УжеБылСозданЗаказПоставщику(ДатаЗаказПоставщика, "Створений автоматично обробкою продажи за " + Формат(ДатаПродажи,"ДФ=dd.MM.yyyy") );	//с.д. рижий 2023-09-11 
		Если УжеСоздан Тогда 
			Возврат;
		КонецЕсли;	
		мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		ДокЗаказПост = Документы.ЗаказПоставщику.СоздатьДокумент(); 	
		ДокЗаказПост.Дата = ДатаЗаказПоставщика;//ТекущаяДата();
		ДокЗаказПост.Контрагент = Поставщик;
		//ДокЗаказПост.ДоговорКонтрагента = ГруппаДоговоров;//С.Д. Сеня 29,08,23 договор не заполняем 
		ДокЗаказПост.Комментарий = "Створений автоматично обробкою продажи за "+ Формат(ДатаПродажи,"ДФ=dd.MM.yyyy") ; 	//с.д. рижий 2023-09-11 
		ДокЗаказПост.Организация = ГруппаДоговоров.Договора[0].Договор.Организация;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокЗаказПост, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Покупка");
		//УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокЗаказПост);
		
		// Зададим, какие реквизиты надо редактировать.
		СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокЗаказПост);
		//СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
		//ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокЗаказПост, ГруппаДоговоров.ВалютаВзаиморасчетов, мВалютаРегламентированногоУчета, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", ДокЗаказПост.ДоговорКонтрагента);
		
		ДокЗаказПост.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		ДокЗаказПост.УчитыватьНДС 		= Истина;
		ДокЗаказПост.СуммаВключаетНДС 	= Ложь;
		//Очищаем товары
		ДокЗаказПост.Товары.Очистить();
		для Каждого СтрТ из Продажи Цикл 
			новСтр = ДокЗаказПост.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, СтрТ);
			//Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НовСтр, ДокЗаказПост, "Приобретение");
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			ДокЗаказПост.Контрагент, ДокЗаказПост.ТипЦен, ДокЗаказПост.ДоговорКонтрагента, ДокЗаказПост.Дата, ДокЗаказПост.ВалютаДокумента, ДокЗаказПост.УчитыватьНДС, ДокЗаказПост.СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(НовСтр, ДокЗаказПост, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
			
			новСтр.Количество = СтрТ.Количество;
			новСтр.Цена = СтрТ.Цена;
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(новСтр, ДокЗаказПост);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(новСтр, ДокЗаказПост);
			
		КонецЦикла;	
		
		Попытка
			ДокЗаказПост.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			//ДокЗаказПост.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда 
				Сообщить("Не удалось создать Заказ поставщику по причине - "+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры	

Функция УжеБылСозданЗаказПоставщику(ДатаЗаказа, Комментарий) Экспорт 
	
	ЗапросПроверки = новый Запрос;
	ЗапросПроверки.Текст = "ВЫБРАТЬ
	                       |	ЗаказПоставщику.Ссылка
	                       |ИЗ
	                       |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                       |ГДЕ
	                       |	НЕ ЗаказПоставщику.ПометкаУдаления
	                       |	И НАЧАЛОПЕРИОДА(ЗаказПоставщику.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	                       |	И ЗаказПоставщику.Контрагент = &Контрагент
	                       //|	И ЗаказПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента
	                       |	И (ВЫРАЗИТЬ(ЗаказПоставщику.Комментарий КАК СТРОКА(100))) = &Комментарий";
	ЗапросПроверки.УстановитьПараметр("Дата", ДатаЗаказа);
	ЗапросПроверки.УстановитьПараметр("Контрагент", Поставщик);
	//ЗапросПроверки.УстановитьПараметр("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()); //С.Д. Сеня 29,08,23 договор пустой +
	ЗапросПроверки.УстановитьПараметр("Комментарий", Комментарий);
	РезПроверки = ЗапросПроверки.Выполнить().Выгрузить();
	
	Если не РезПроверки.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	
 Процедура ВыгрузитьВXLS(ИмяФайла) 
	 
	 ТаблицаЗначений = Продажи.Выгрузить(,"НоменклатураПоставщика,Количество,Цена,Стоимость");
	 ТЗвТДивЕксель(ТаблицаЗначений, ИмяФайла)
     
 КонецПроцедуры
 
Процедура ТЗвТДивЕксель (ТаблицаЗначений, ИмяФайла)
	
	ТД = Новый ТабличныйДокумент;
    КолонокВсего = ТаблицаЗначений.Колонки.Количество();
	Для Колонка = 1 По КолонокВсего Цикл
		Если ТаблицаЗначений.Колонки[Колонка - 1].Заголовок = "Номенклатура поставщика" Тогда 
       		ТД.Область(1, Колонка).Текст = "Номенклатура";
		Иначе	 
       		ТД.Область(1, Колонка).Текст = ТаблицаЗначений.Колонки[Колонка - 1].Заголовок;
		КонецЕсли;	
		ТД.Область(1, Колонка).Обвести(Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1), Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	КонецЦикла;
    Строка = 1;
    Для Каждого ТаблицаСтрока Из ТаблицаЗначений Цикл
        Строка = Строка + 1;
		Для Колонка = 1 По КолонокВсего Цикл
			
            ТД.Область(Строка, Колонка).Текст = ТаблицаСтрока.Получить(Колонка - 1);
			ТД.Область(Строка, Колонка).Обвести(Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1), Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
		КонецЦикла;
    КонецЦикла;
    ТД.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);       
    
КонецПроцедуры
